app/controllers/comments_controller.rb

	def create
		@comment = @student.comments.build(comment_params)
		if @comment.save
---
INSERT INTO `comments` (`student_id`, `content`, `created_at`, `updated_at`) VALUES (1, 'test\r\n', '2016-08-30 12:21:37', '2016-08-30 12:21:37')

	def set_student
		@student = Student.find(params[:student_id])
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1