app/controllers/sessions_controller.rb

	def create
		@user = User.find_by_email(params[:session][:email])
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'josh.daniels.holgate@gmail.com' LIMIT 1