app/controllers/students_controller.rb

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
---
	def edit
		@student = Student.find(params[:id])

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
UPDATE `students` SET `year` = '2' WHERE `students`.`id` = 1
---
	def update
		@student = Student.find(params[:id])
		@student.update(student_params)

SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1
---
	def destroy
		@comment = Comment.find(params[:id])
		@comment.destroy