app/controllers/users_controller.rb

	def create
	 @user = User.new(user_params)
     if @user.save
---
INSERT INTO `users` (`first_name`, `last_name`, `email`, `password_digest`, `school`, `created_at`, `updated_at`) VALUES ('Josh', 'Daniels-Holgate', 'josh.daniels.holgate@gmail.com', '$2a$10$1o2JpjVh12Z0nGu5Vvkxxe9LiJpG.aFWs4lrg.k0VbPWBda/u1/C6', 'UCL', '2016-08-30 12:08:16', '2016-08-30 12:08:16')